package Day1;

//тестовое задание "1 день"
//Задачи внизу:
//------------------------------------------------------------------
//1=ЗАДАНИЕ
//------------------------------------------------------------------
public class Day1_test {
    public static void main(String[] args) {
        //int value = 0; // задаю значение value 0
        // while (value < 10) { // выполняется пока значение <10
        //   System.out.print("JAVA "); // вывожу в одну строку
        // value = value + 1;} //увеличение на +1
//------------------------------------------------------------------
//2=ЗАДАНИЕ
//------------------------------------------------------------------
        //int i - переменная счетчик * Условие i<=10  * i++  условие означает что мы будем делать проходя цикл , так-же i++ == i = i+1
        // for (int i = 0 ; i<=10;i++ ){
        //     System.out.print("JAVA ");
        // }
//------------------------------------------------------------------
//3=ЗАДАНИЕ
//------------------------------------------------------------------
        //  for (int i = 0 ; i<=10;i++ ){
        //    System.out.println("JAVA"); //ln перевел на другую строку
        //  }
//------------------------------------------------------------------
//4=ЗАДАНИЕ
//------------------------------------------------------------------
        // int year =1980;
        //  while (year <= 2020) {
        // System.out.println("Олимпиада "+year+" года");
        //  year = year + 4;}
//------------------------------------------------------------------
//5=ЗАДАНИЕ
//------------------------------------------------------------------

        // for (int year = 1980 ; year<=2020;year+=4 ){
        //   System.out.println("Олимпиада "+year+" года");   }
//------------------------------------------------------------------
//6=ЗАДАНИЕ
//------------------------------------------------------------------
        int k= 2;
        for (int i = 2 ; i<=10;i++ ){
            System.out.println(i+"x"+k+"="+i*k);}
        //***************************************************************************
    } }
//Уроки
//https://www.youtube.com/watch?v=ziOQ8wkmnSE&feature=youtu.be&ab_channel=alishev
//https://www.youtube.com/watch?v=lmK15qB_r70&feature=youtu.be&ab_channel=alishev
// https://www.youtube.com/watch?v=-YK8B4WO7nI&feature=youtu.be
//https://www.youtube.com/watch?v=15PjODTSTaw&feature=youtu.be
//https://www.youtube.com/watch?v=UYbdAmgcNVc&feature=youtu.be&ab_channel=alishev
//https://metanit.com/java/tutorial/2.9.php

//        Задачи:
//        1. Вывести на экран слово ​ “JAVA”​ , в строку, чтобы оно повторилось 10
//        цикл ​ while​ .
//                Вывод в консоль должен быть таким:
//        JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA JAVA
//        2. Повторить задание 1, но используя цикл ​ for​ .
//        3. Вывести на экран слово ​ “JAVA”​ , в столбик, чтобы оно повторилось 10
//        используя цикл на ваше усмотрение (​ for​или ​ while​ ).
//                Вывод в консоль должен быть таким:
//        JAVA
//        JAVA
//        JAVA
//        JAVA
//        JAVA
//        JAVA
//        JAVA
//        JAVA
//        JAVA
//        JAVA
//        4. Объявите переменную типа ​ int​ , имя переменной - ​year​ . Присвойте э
//        переменной значение 1980. Используя цикл ​ while​ , выведите в столбик
//“Олимпиада X года”, где X - это число, которое принимает значения, нач
//        до 2020 с шагом увеличения равным 4.
//        То есть на первой итерации цикла, X равен 1980, а на каждой следующе
//        значение X увеличивается на 4. Строки такого вида выводятся до тех по
//        значение X не станет больше 2020.
//        Пример:
//        year = 1980​ , вывод должен быть таким:
//        Олимпиада 1980 года
//        Олимпиада 1984 года
//        Олимпиада 1988 года
//        Олимпиада 1992 года
//……
//        Олимпиада 2016 года
//        Олимпиада 2020 года
//        5. Повторить задание 4, но используя цикл ​ for​ .
//        6. Объявите переменную типа ​ int​ , имя переменной - ​k​ . Присвойте этой переменной
//        какую-нибудь цифру от 1 до 9. Используя цикл на ваше усмотрение (​ for​или ​while​ ),
//                выведите в консоль таблицу умножения для этой цифры в следующем формате:
//        1 x k = …
//        2 x k = …
//        3 x k = …
//……
//        9 x k = …
//        Пример:
//        k = 3
//        Вывод в консоль:
//        1 x 3 = 3
//        2 x 3 = 6
//        3 x 3 = 9
//……
//        9 x 3 = 27


